@internet-diglett when I create multiple `links` with `lldp_link_config` enabled the API response does not show them both as `enabled`. Notice how the first element has a null `lldp_link_config` but the second element doesn't. This is the output retrieved directly from the `/v1/system/networking/switch-port-settings/example` API.

```json
  "links": [
    {
      "port_settings_id": "698f4600-0f9d-48d0-ad8b-caf00e7b0e92",
      "link_name": "phy0",
      "mtu": 1500,
      "fec": null,
      "speed": "speed1_g",
      "autoneg": false,
      "lldp_link_config": null,
      "tx_eq_config": null
    },
    {
      "port_settings_id": "698f4600-0f9d-48d0-ad8b-caf00e7b0e92",
      "link_name": "phy1",
      "mtu": 1500,
      "fec": null,
      "speed": "speed10_g",
      "autoneg": false,
      "lldp_link_config": {
        "id": "42f34fbd-6556-4dff-ab4b-e387ed7a761a",
        "enabled": true,
        "link_name": "phy0",
        "link_description": null,
        "chassis_id": null,
        "system_name": null,
        "system_description": null,
        "management_ip": null
      },
      "tx_eq_config": null
    }
  ],
```

This results in a non-empty refresh plan.

```
> terraform apply
oxide_switch_port_settings.example: Refreshing state... [id=698f4600-0f9d-48d0-ad8b-caf00e7b0e92]

Terraform will perform the following actions:

  # oxide_switch_port_settings.example will be updated in-place
  ~ resource "oxide_switch_port_settings" "example" {
      ~ id            = "698f4600-0f9d-48d0-ad8b-caf00e7b0e92" -> (known after apply)
      ~ links         = [
          - {
              - autoneg   = false -> null
              - link_name = "phy1" -> null
              - mtu       = 1500 -> null
              - speed     = "speed10_g" -> null
            },
          + {
              + autoneg   = false
              + link_name = "phy1"
              + lldp      = {
                  + enabled   = true
                  + link_name = "phy0"
                }
              + mtu       = 1500
              + speed     = "speed10_g"
            },
            # (1 unchanged element hidden)
        ]
        name          = "example"
      ~ time_created  = "2025-07-18 16:37:02.914391 +0000 UTC" -> (known after apply)
      ~ time_modified = "2025-07-18 16:37:02.914391 +0000 UTC" -> (known after apply)
        # (5 unchanged attributes hidden)
    }
```

Wondering if this is a bug in the Omicron API.